Tekla Open API Reference for Tekla Structures 2025
ViewBase.IsSheet Property
 Gets a value indicating whether the container view is the drawing's sheet.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsSheet { get; }
Public ReadOnly Property IsSheet As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace